Revit 2023 API
ExternalServiceOptions Properties
The ExternalServiceOptions type exposes the following members.
Properties
Name | Description
IsPublic
 This property denotes a service as either public or private.
IsRecordable
 Indicates whether executions of the service is recorded in documents or not.
IsSelfsynchronizing
 Indicates whether the service's record of used services (in a particular document) can independently wary between local clients and the corresponding central model. It is then up to the service's owner to assure proper local-central synchronization.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace